app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    if @book.save
---
INSERT INTO "books" ("title", "created_at", "updated_at") VALUES ('', '2026-09-12 17:56:40.422879', '2026-09-12 17:56:40.422879') RETURNING "id"

  def update
    if @book.update(book_params)
---
UPDATE "books" SET "updated_at" = '2026-09-13 06:38:15.532687', "author" = 'author', "price" = 2.0, "published_date" = '2026-09-13' WHERE "books"."id" = 3

  def delete
    @book.destroy
---
DELETE FROM "books" WHERE "books"."id" = 1